Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/overview--52nSOS_overview.tmx
Source language: en
Languages: ja

source: The 52°North |SOS| supports the interoperable provision of live and archived sensor observation data. A sensor could be a water level meter in a stream, a weather station, or an air quality monitoring station.
ja: 52°North |SOS| は、ライブおよびアーカイブされたセンサー観測データの相互運用可能な提供をサポートします。センサーには、河川の水位計、気象ステーション、大気質モニタリングステーションなどがあります。

source: Core Features
ja: 主要機能

source: **Browser Client**: The SOS is delivered with a browser based application. This provides means for administration and configuration of the service instance, as well as sending test requests for SOS operations; appropriate sample requests are included.
ja: **ブラウザクライアント**:SOSはブラウザベースのアプリケーションで提供されます。これにより、サービス・インスタンスの管理と構成、およびSOS操作のテスト要求の送信のための手段が提供されます。適切なサンプル要求が含まれます。

source: **Helgoland**: The SOS contains the Helgoland application for the exploration, analysis and visualization of Sensor Web data in various fields of use, e.g. hydrology, meteorology, environmental monitoring, traffic management.
ja: **Helgoland**:SOSには、水文、気象、環境モニタリング、交通管理など、さまざまな使用分野におけるセンサーWebデータの調査、分析、視覚化のためのHelgolandアプリケーションが含まれています。

source: **Specifications**: The 52°North SOS implements the current specification version 2.0.0 and the previous version 1.0.0 (here no transactional operations). Implemented operations for each standard version are listed below.
ja: **仕様**: 52°North SOSは、現在の仕様バージョン2.0.0および以前のバージョン1.0.0を実装します(ここではトランザクション操作はありません)。各標準バージョンに実装されている操作を以下に示します。

source: **INSPIRE Download Service Extension**: Starting with Version 4.2.0, an extension is available that allows the SOS to be used as an INSPIRE download service. Background information is provided in a `blog post <https://blog.52north.org/2014/01/30/52north-supports-the-jrc-in-developing-an-inspire-download-service-based-on-sos/>`_ and in the `wiki <https://wiki.52north.org/SensorWeb/SensorObservationServiceIVDocumentation#INSPIRE_Download_Service_extensi>`_ .
ja: **INSPIRE ダウンロードサービス拡張**: バージョン4.2.0以降では、SOSをINSPIREダウンロードサービスとして使用できるように拡張されています。背景情報は、`ブログポスト <https://blog.52north.org/2014/01/30/52north-supports-the-jrc-in-developing-an-inspire-download-service-based-on-sos/>`_ および `Wiki <https://wiki.52north.org/SensorWeb/SensorObservationServiceIVDocumentation#INSPIRE_Download_Service_extensi>`_で提供されています。

source: **Air Quality Data e-Reporting Extension**: Starting with version 4.3.0, an extension is available that provides for the Air Quality Data Flows E1a, E1b and E2a compliant data (the instance on OSGeoLive is not configured accordingly). The `installation and configuration <https://wiki.52north.org/SensorWeb/AqdEReporting#Installation>`_ is documented in the 52°North Wiki.
ja: **Air Quality データ eレポート拡張**: バージョン4.3.0以降では、Air Quality Data Flows E1a、E1b、およびE2a準拠データを提供する拡張機能が使用可能です(OSGeoLiveのインスタンスは適切に設定されていません)。`インストールと設定 <https://wiki.52north.org/SensorWeb/AqdEReporting#Installation>`_ は 52°North Wiki 内に記載されています。

source: **Sensor Web REST-API**: Starting with Version 4.1.1., a bundle version is available, that directly provides the `RESTful API <https://wiki.52north.org/SensorWeb/SensorWebClientRESTInterface>`_, is available. Hence, observation data can be requested in a RESTful way and is returned in JSON encoded responses. More details incl. documentation can be found in the `SOS webapp <http://localhost:8080/52nSOS/static/doc/api-doc/>`_.
ja: **センサー Web REST-API**: バージョン4.1.1以降では、バンドルバージョンが使用可能で、 `RESTful API <https://wiki.52north.org/SensorWeb/SensorWebClientRESTInterface>`_ が直接使用可能です。したがって、観測データはRESTfulな方法で要求することができ、JSONエンコードされた応答で返されます。詳細については`SOS webapp <http://localhost:8080/52nSOS/static/doc/api-doc/>`_ 内で文書を確認できます。

source: **INSPIRE Sepcialized Observations**: Support for the INSPIRE Specialized Observations defined in Guidelines for the use of `Observations & Measurements and Sensor Web Enablement-related standards in INSPIRE (D2.9) <https://inspire.ec.europa.eu/id/document/tg/d2.9-o%26m-swe>`_ (`detailed information about the implementation <https://wiki.52north.org/SensorWeb/InspireSpecialisedObservations>`_).
ja: **INSPIRE 専門観測**: `INSPIREにおける観測と測定及びセンサーWeb対応関連標準規格 (D2.9) <https://inspire.ec.europa.eu/id/document/tg/d2.9-o%26m-swe>`_ ガイドラインで定義されている INSPIRE 専門観測をサポートしています(`実装についての詳細情報 <https://wiki.52north.org/SensorWeb/InspireSpecialisedObservations>`_)。

source: **ResultFiltering**: Support for the filtering the observations (GetObservation) and data availabiliy information (GetDataAvailability) by the value of the observation.
ja: **結果フィルタリング**: 観測データ(GetObservation)とデータ可用性情報(GetDataAvailability)の観測データ値でのフィルタリングをサポートしています。

source: **Read more**: `Details of the implemented functionalities <https://wiki.52north.org/SensorWeb/SensorObservationServiceIVDocumentation#Features>`_ can be found in the 52°North Wiki.
ja: **詳細**: `実装された機能の詳細 <https://wiki.52north.org/SensorWeb/SensorObservationServiceIVDocumentation#Features>`_ は 52°North Wiki にあります。

source: The development of this version of the 52°North SOS was supported by different projects, organizations, and persons. More details can be found in the `52°North SOS client <http://localhost:8080/52nSOS/index>`_.
ja: このバージョンの 52°North SOS の開発は、様々なプロジェクト、組織、メンバーによってサポートされています。詳細については `52°North SOS client <http://localhost:8080/52nSOS/index>`_ を参照してください。

source: We would like to thank the Belgian Interregional Environment Agency (`IRCEL - CELINE <https://www.irceline.be/en/>`_) for providing the demonstration data used in this SOS installation. The demo data are published under a |CC BY 3.0| License.
ja: 我々は、このSOSインストールで利用されているデモデータを提供してくれた、ベルギーの地域間環境庁(`IRCEL - CELINE <https://www.irceline.be/en/>`_)に感謝の意を表します。でもデータは、 |CC BY 3.0| ライセンスの下で公開されています。

source: SOS Operations
ja: SOS 操作

source: **Queries**:
ja: **クエリ**:

source: GetCapabilities: for requesting a self-description of the service.
ja: GetCapabilities: サービスの自己記述を要求します。

source: DescribeSensor: for requesting information about the sensor.
ja: DescribeSensor: センサーに関する情報を要求します。

source: GetFeatureOfInterest / GetFeatureOfInterestTime (from 1.0): for requesting features (e.g. sensor/measurement locations).
ja: GetFeatureOfInterest / GetFeatureOfInterestTime (1.0以降): 機能(センサー/測定位置など)を要求します。

source: GetObservationById / GetObservation: for requesting observations.
ja: GetObservationById / GetObservation: 観測データを要求します。

source: GetResult (from specification version 2.0): for requesting sensor data.
ja: GetResult (仕様バージョン2.0以降): センサーデータを要求します。

source: GetResultTemplate (from specification version 2.0): for requesting a template of the result structure that will be returned by a GetResult request.
ja: GetResultTemplate (仕様バージョン2.0以降): GetResult 要求で返される結果データのテンプレートを要求します。

source: GetDataAvailability (from `SOS 2.0 Hydrology Profile - OGC Best Practice <https://docs.ogc.org/bp/14-004r1/14-004r1.html#38>`_): for requesting the data availability for certain configurations.
ja: GetDataAvailability (`SOS 2.0 水文学プロファイル - OGC ベストプラクティス <https://docs.ogc.org/bp/14-004r1/14-004r1.html#38>`_): 特定の構成のデータ可用性を要求します。

source: **Transactions**:
ja: **トランザクション**:

source: InsertSensor (from specification version 2.0): for inserting metadata of new sensors.
ja: InsertSensor (仕様バージョン2.0以降): 新しいセンサーのメタデータを挿入します。

source: InsertObservation (from specification version 2.0): for inserting new observations.
ja: InsertObservation (仕様バージョン2.0以降): 新しい観測データを挿入します。

source: UpdateSensorDescription (from specification version 2.0): for updating the description of a sensor.
ja: UpdateSensorDescription (仕様バージョン2.0以降): センサーの説明を更新します。

source: DeleteSensor (from specification version 2.0): for deleting a sensor/procedure and all related offerings and observations.
ja: DeleteSensor (仕様バージョン2.0以降): センサー/プロシージャと全ての関連する提供物と観測データを削除します。

source: DeleteObservation (extension for SOS specification 2.0): for deleting an observation.
ja: DeleteObservation (SOS 仕様 2.0の拡張): 観測データを削除します。

source: InsertResultTemplate (from specification version 2.0): for inserting a result template.
ja: InsertResultTemplate (仕様バージョン2.0以降): 結果テンプレートを挿入します。

source: InsertResult (from specification version 2.0): for inserting results.
ja: InsertResult (仕様バージョン2.0以降): 結果データを挿入します。

source: InsertFeatureOfInterest for feature insertion
ja: InsertFeatureOfInterest 地物を挿入します。

source: DeleteResultTemplate for the deletion of resultTemplates by identifier or offering/observedProperty pairs
ja: DeleteResultTemplate 識別子または提供サービスID/計測項目ペアにより、結果テンプレートを削除します。

source: Within these operations, the following filter operators are possible where applicable:
ja: これらの操作では、該当する場合、以下のフィルタ演算子が利用可能です:

source: Spatial filter: BBOX, using a bounding box.
ja: 空間フィルタ: BBOX、バウンディングボックスを指定します。

source: Temporal filter: During, with time period.
ja: 時間フィルタ: During、期間を指定します。

source: Temporal filter: TEquals, with time instant.
ja: 時間フィルタ: TEquals、時間を指定します。

source: Applicable Standards
ja: 適用可能な標準規格

source: Details
ja: 詳細

source: **Website:** https://52north.org/software/software-projects/sos
ja: **Webサイト:** https://52north.org/software/software-projects/sos

source: **Licence:** GNU General Public License (GPL) version 2
ja: **ライセンス:** GNU General Public License (GPL) version 2

source: **Software Version:** |version-52nSOS|
ja: **ソフトウェアバージョン:** |version-52nSOS|

source: **Supported Platforms:** Windows, Linux, Mac
ja: **対応プラットフォーム:** Windows, Linux, Mac

source: **Supported Java Versions:** 7+, (bundle version: 8+)
ja: **サポートする Java バージョン:** 7+, (バンドルバージョン: 8+)

source: **Supported DBMS:** PostgreSQL (9+) + PostGIS (2+), MariaDB/MySQL (5.6+), Oracle DB (9+), SQL Server 2012
ja: **サポートする DBMS:** PostgreSQL (9+) + PostGIS (2+), MariaDB/MySQL (5.6+), Oracle DB (9+), SQL Server 2012

source: **Commercial Support:** https://52north.org/services/
ja: **商用サポート:** https://52north.org/services/

source: **Community Support:** https://list.52north.org/mailman/listinfo/sensorweb
ja: **コミュニティサポート:** https://list.52north.org/mailman/listinfo/sensorweb

source: **Community Website:** https://52north.org/research/research-labs/sensor-web/
ja: **コミュニティWebサイト:** https://52north.org/research/research-labs/sensor-web/

source: **Other 52°North projects on OSGeoLive:** :doc:`WPS <./52nWPS_overview>`
ja: **OSGeoLiveでの他の 52°North プロジェクト:** :doc:`WPS <./52nWPS_overview>`

source: Quickstart
ja: クイックスタート

source: :doc:`Quickstart documentation <../quickstart/52nSOS_quickstart>`
ja: :doc:`クイックスタート文書 <../quickstart/52nSOS_quickstart>`
